In [4]:
import pandas as pd
df=pd.read_csv("Dataset/deloitte.csv")

df.head()

,Employee ID,Name,Department,Position,Salary,Joining Date,Unnamed: 6
0,201,Aarav Mehta,Consulting,Consultant,80000,2020-02-10,NaN
1,202,Priya Sharma,Tax,Tax Analyst,70000,2019-05-23,NaN
2,203,Rohan Verma,Audit,Audit Associate,65000,2021-06-14,NaN
3,204,Ananya Gupta,Risk Advisory,Risk Analyst,72000,2020-08-17,NaN
4,205,Arjun Patel,Technology,Tech Analyst,75000,2018-11-05,NaN

In [32]:
# check the dataframe columns.
df.columns

Index(['Employee ID', 'Name', 'Department', 'Position', 'Salary',
       'Joining Date', 'Unnamed: 6'],
      dtype='object')

In [13]:
#access the columns "Position"
df['Position']

#check the 1st 5 rows of column Position.
df['Position'].head()

#check the last row
df['Position'].tail()

0         Consultant
1        Tax Analyst
2    Audit Associate
3       Risk Analyst
4       Tech Analyst
Name: Position, dtype: object

In [14]:
#print the first value of name
df['Name'][0]

#print the 5th value of name
df['Name'][5]

0          Aarav Mehta
1         Priya Sharma
2          Rohan Verma
3         Ananya Gupta
4          Arjun Patel
5           Meera Iyer
6       Karan Malhotra
7           Sneha Nair
8         Vikram Singh
9     Ishita Choudhary
10        Rahul Khanna
11         Pooja Desai
12       Siddharth Rao
13         Neha Kapoor
14        Manish Joshi
Name: Name, dtype: object

In [16]:
#print the rows from 5 to 15 in employee Id
df['Employee ID'][5:15]

5     206
6     207
7     208
8     209
9     210
10    211
11    212
12    213
13    214
14    215
Name: Employee ID, dtype: int64

In [26]:
#print the even index row from 5 to 15 in Salary
df['Salary'][5:15:2]

5      95000
7      83000
9      94000
11    110000
13    115000
Name: Salary, dtype: int64

In [27]:
#how can we access the multiple columns at a time
df[['Name','Position','Salary']].head()

           Name         Position  Salary
0   Aarav Mehta       Consultant   80000
1  Priya Sharma      Tax Analyst   70000
2   Rohan Verma  Audit Associate   65000
3  Ananya Gupta     Risk Analyst   72000
4   Arjun Patel     Tech Analyst   75000

In [29]:
# loc() loc is used to locate rows
#syntax df.loc[start:end:step]
df.columns

Index(['Employee ID', 'Name', 'Department', 'Position', 'Salary',
       'Joining Date', 'Unnamed: 6'],
      dtype='object')

In [8]:
#By using the loc access the row from 5 to 20 index for "totalDepartment" columns
df['Department'].loc[5:20]

5        Consulting
6               Tax
7             Audit
8     Risk Advisory
9        Technology
10       Consulting
11              Tax
12            Audit
13    Risk Advisory
14       Technology
Name: Department, dtype: object

In [9]:
#Locate the rows of Employee Id  Name and Salary by using the loc from 5 to 20.
df[['Employee ID','Name','Salary']].loc[5:20]

    Employee ID              Name  Salary
5           206        Meera Iyer   95000
6           207    Karan Malhotra   88000
7           208        Sneha Nair   83000
8           209      Vikram Singh   90000
9           210  Ishita Choudhary   94000
10          211      Rahul Khanna  120000
11          212       Pooja Desai  110000
12          213     Siddharth Rao  105000
13          214       Neha Kapoor  115000
14          215      Manish Joshi  118000

In [13]:
#apply in condition in dataframe in particular coulm
df['Employee ID']%2==0

0     False
1      True
2     False
3      True
4     False
5      True
6     False
7      True
8     False
9      True
10    False
11     True
12    False
13     True
14    False
Name: Employee ID, dtype: bool

In [14]:
#In dataframe to apply the condition we use df.loc
df.loc[df["Employee ID"]%2==0]['Employee ID']

1     202
3     204
5     206
7     208
9     210
11    212
13    214
Name: Employee ID, dtype: int64

In [18]:
# iloc(): iloc is a pass axis number of rows and columns.
import numpy as np
import pandas as pd
a=np.array([[2,4,5],[6,8,10]])
print(a)

# print the 4 5 8 10
print("the result is\n",a[0:2,1:3])

[[ 2  4  5]
 [ 6  8 10]]
the result is
 [[ 4  5]
 [ 8 10]]

In [19]:
#syntax df.iloc [row_index,col_index]
df.iloc[0:5,0:3]

   Employee ID          Name     Department
0          201   Aarav Mehta     Consulting
1          202  Priya Sharma            Tax
2          203   Rohan Verma          Audit
3          204  Ananya Gupta  Risk Advisory
4          205   Arjun Patel     Technology

In [55]:
#print the even index row up to 20 for firstcolumns using loc.
# df.iloc[0:100:2,0:1]%2==0


# df.iloc[df['Employee ID']%2==0]['Employee ID

In [30]:
# What is the difference between loc and iloc.
# df.loc support filtering of the data where as df.iloc won't filtering of the data

# df['col'].loc[start:end:step]
# apply condition---> df.loc[df['col']%2==0]

# Import dataframe condition
# 1st-->  df[col], df[[col1,col2,col3]]
# 2nd:--> df.loc[start:end:step]
# 3rd:--> df.iloc[row_index,col_index]

SyntaxError: invalid decimal literal (2481104368.py, line 9)